Revit 2027 API
ExportFontInfo(ExportFontInfo) Constructor
 Constructs a new copy of the input ExportFontInfo object.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ExportFontInfo(
	ExportFontInfo other
)
Public Sub New (
	other As ExportFontInfo
)
public:
ExportFontInfo(
	ExportFontInfo^ other
)
new :
        other : ExportFontInfo -> ExportFontInfo
Parameters
other ExportFontInfo
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
ExportFontInfo Class
ExportFontInfo Overload
Autodesk.Revit.DB Namespace